In [3]:
import pandas as pd

FILE_PATH = 'dados.csv'

df = pd.read_csv(FILE_PATH)
df.head(2)

   UF  Sexo  Idade  Cor  Anos de Estudo  Renda    Altura
0  11     0     23    8              12    800  1.603808
1  11     1     23    2              12   1150  1.739790

In [4]:
df_students = pd.DataFrame(data = {'Fulano': [8, 10, 4, 8, 6, 10, 8],
                                   'Beltrano': [10, 2, 0.5, 1, 3, 9.5, 10],
                                   'Sicrano': [7.5, 8, 7, 8, 8, 8.5, 7]},
                           index = ['Math', 'Portuguese', 'English', 'Geography', 'History', 'Physics', 'Chemistry'])
df_students.rename_axis('Subjects', axis='columns', inplace=True)
df_students

Subjects    Fulano  Beltrano  Sicrano
Math             8      10.0      7.5
Portuguese      10       2.0      8.0
English          4       0.5      7.0
Geography        8       1.0      8.0
History          6       3.0      8.0
Physics         10       9.5      8.5
Chemistry        8      10.0      7.0

In [10]:
df.groupby(['Sexo'])[['Idade', 'Renda']].mean()

          Idade        Renda
Sexo
0     44.046554  2192.441596
1     44.127554  1566.847393

In [16]:
fulano_grades = df_students['Fulano']
fulano_grades

Math           8
Portuguese    10
English        4
Geography      8
History        6
Physics       10
Chemistry      8
Name: Fulano, dtype: int64

In [19]:
fulano_grades = fulano_grades.sort_values()
fulano_grades

English        4
History        6
Math           8
Geography      8
Chemistry      8
Portuguese    10
Physics       10
Name: Fulano, dtype: int64

In [20]:
fulano_grades = fulano_grades.reset_index()
fulano_grades

        index  Fulano
0     English       4
1     History       6
2        Math       8
3   Geography       8
4   Chemistry       8
5  Portuguese      10
6     Physics      10

In [28]:
fulano_grades['Fulano'].median()

8.0

In [30]:
fulano_grades['Fulano'].quantile()

8.0

In [29]:
beltrano_grades = df_students['Beltrano'].sample(6, random_state=101)
beltrano_grades

Math          10.0
English        0.5
Physics        9.5
History        3.0
Chemistry     10.0
Portuguese     2.0
Name: Beltrano, dtype: float64

In [31]:
df_students

Subjects    Fulano  Beltrano  Sicrano
Math             8      10.0      7.5
Portuguese      10       2.0      8.0
English          4       0.5      7.0
Geography        8       1.0      8.0
History          6       3.0      8.0
Physics         10       9.5      8.5
Chemistry        8      10.0      7.0

In [32]:
df_students['Fulano'].mode()

0    8
Name: Fulano, dtype: int64

In [33]:
df['Renda'].mode()

0    788
Name: Renda, dtype: int64